import { useState } from "react";
import Footer from "../Footer";
import Header from "../Header";
import HeadBanner from "../HeadImgTitle";
import MainMenuFilter from "../MainMenuFilter";
import QuestionBox from "../QuestionBox";

export default function Privacy(){
    const [questions] = useState(
        [
            {title:'حریم خصوصی',answer:'ترخینه متعهد می‌شود حریم خصوصی شما را حفظ کند و به آن احترام بگذارد. بخش «حریم خصوصی» روش‌های استفاده از اطلاعات شخصی کاربران در این وب سایت را شرح می‌دهد. اگر برای سفارش غذای خوب از خدمات ما استفاده می‌کنید، سیاست‌های حفظ حریم خصوصی وب‌سایت ترخینه، در مورد شما صدق می‌کند. پردازش و ارسال سفارش‌ها نیازمند اطلاعات دقیق کاربران است؛ برای این‌که بتوانیم خدمات مطلوب‌تری به شما ارائه دهیم، ممکن است به هنگام خرید، ثبت نظر و استفاده از برخی امکانات سایت، به اطلاعات شما نیاز داشته باشیم؛ هم‌چنین ترخینه برای ارتباط با مشتریان، بهبود رابط کاربری، بهینه‌سازی محتوا و تحقیقات بازاریابی، بایستی از اطلاعات کاربران خود استفاده کند. این در حالی است که اطلاع‌رسانی خدمات جدید و سرویس‌های ویژه یا پروموشن‌ها، اخبار و رویدادها با ارسال ایمیل یا پیامک به کاربران انجام می‌شود.'},
            {title:'چه اطلاعاتی را گردآوری می‌کنیم؟',answer:'اطلاعاتی که درباره‌ی شما گردآوری و نگه‌داری می‌کنیم، ممکن است شامل موارد زیر باشد:\n نام و نام خانوادگی شما\nشماره تلفن همراه\nتاریخ تولد\nنشانی‌های مورد نظر برای تحویل سفارش‌ها\nاطلاعات دیگری که شما برای ما نوشته‌اید یا از راه‌های دیگر در اختیار ما قرار داده‌اید.'},
            {title:'چگونه اطلاعات شما را گردآوری می‌کنیم؟',answer:'از شما تقاضا خواهیم کرد اطلاعات خود را در اختیار ما قرار دهید؛ هنگامی‌که:به‌شکل کاربر مهمان غذا سفارش می‌دهید.\nدر وب‌سایت ترخینه یک حساب کاربری ایجاد می‌کنید.\nدر قسمت اعطای نمایندگی، فرم پر می‌کنید.'},
            {title:'چرا به شماره تلفن شما نیاز داریم؟',answer:'برای ثبت نام در وب‌سایت ترخینه باید نخست شماره موبایل خود را وارد کنید تا کد فعال‌سازی برای شما ارسال شود.\nشماره تلفن همراه شما نقش نام کاربری را ایفا می‌کند.\nممکن است به هر دلیل رمز عبور خود را فراموش کنید؛ در این موقعیت، می‌توانید از تلفن همراه خود کد فعال‌سازی مجدد دریافت کنید.\nممکن است برای آگاه کردن شما از اخبار و تغییرات جدید از شماره همراهتان استفاده کنیم؛ مانند، اطلاع‌رسانی از تغییر شیوه‌ی دسترسی شما به خدمات آنلاین ما، یا خدمات جدید و پیشنهادهای خاص.'},
            {title:'فعالیت‌های مرورگر شما در هنگام بازدید از وب‌سایت ترخینه',answer:'هنگامی‌که شما از وب‌سایت ترخینه استفاده می‌کنید، ما اطلاعاتی درباره‌ی فعالیت‌های شما گردآوری می‌کنیم که برخی از این اطلاعات عبارتند از:\nنشانی آی. پی. کامپیوتر شما (این نشانی یک شماره‌ی دیجیتالی ۱۲ رقمی منحصربه‌فرد است که برنامه‌های اینترنتی به‌وسیله‌ی آن کامپیوتر را شناسایی و با آن ارتباط برقرار می‌کنند).\nنوع مرورگری که شما استفاده می‌کنید (مرورگر برنامه‌ای است که شما برای دیدن وب‌سایت‌ها از آن استفاده می‌کنید؛ مانند Internet Explorer، Firefox، Safari، Google Chrome).\nزمانی‌که شما وارد وب‌سایت شده‌اید و مدت زمانی که از وب‌سایت استفاده کرده‌اید.\nURL مرجع شما (سایتی که شما برای دسترسی و ورود به وب‌سایت ما از آن استفاده کرده‌اید).\nما با استفاده از این اطلاعات نمی‌توانیم شما را شناسایی کنیم، بلکه این اطلاعات را از تعداد بسیار بازدیدکنندگان سایت‌مان گردآوری و آن‌ها را تحلیل می‌کنیم؛ با استفاده از این اطلاعات، می‌توانیم بفهمیم که کابران چگونه از وب‌سایت ما استفاده می‌کنند و فهمیدن این موضوع به ما کمک می‌کند خدمات بهتری به آنان ارائه دهیم.'},
            {title:'استفاده از کوکی‌ها و دستگاه‌های ذخیره‌سازی دیگر',answer:'کوکی‌ها فایل‌های اطلاعاتی هستند که روی کامپیوتر شما ذخیره می‌شوند تا به وب‌سایت‌ها کمک کنند شما را به خاطر بیاورند. ما و همکاران‌مان، با استفاده از کوکی‌ها اطلاعاتی درباره شیوه‌ی استفاده شما از وب‌سایت‌مان گردآوری می‌کنیم؛ این اطلاعات ما را در بهبود رابط کاربری و محتوای سایت کمک خواهد کرد. شما نیز به وسیله‌ی ثبت و ذخیره‌سازی این کوکی‌ها، هنگام ورود مجدد به سایت، نیازی به ثبت مجدد نام کاربری و کلمه‌ی عبور نخواهید داشت. هم‌چنین ما به وسیله‌ی کوکی‌ها، آخرین وضعیت سفارش روز شما را ذخیره می‌کنیم تا شما بتوانید آن‌ها را در پروفایل خود مشاهده کنید.'},
            {title:'اطلاعات بیشتر',answer:'در مجموعه‌ی ترخینه، حفظ امنیت اطلاعات شخصی شما را امری بسیار جدی و مهم می‌دانیم و در وب‌سایت خود از سیاست‌های امنیتی و فناوری‌هایی استفاده می‌کنیم که برای محافظت از اطلاعات شخصی طراحی شده‌اند؛ هم‌چنین از روش‌ها و دستورالعمل‌های امنیتی سختی که قوانین حفظ حریم خصوصی کاربران به آن‌ها نیاز دارد، پیروی می‌کنیم. این روش‌های محافظتی ذخیره‌سازی، استفاده و انتشار همه‌ی اطلاعات شما را دربر می‌گیرد و از دسترسی و استفاده‌ی غیرمجاز از این اطلاعات جلوگیری می‌کند.'},
        ]
    )
    return(
        <>
            <Header />
            <HeadBanner img='images/privacy-img.png' title='حریم شخصی کاربران'/>
            <MainMenuFilter/>
            <QuestionBox questions={questions}/>
            <Footer />
        </>
    )
}