import { useState } from "react";
import Footer from "../Footer";
import Header from "../Header";
import HeadBanner from "../HeadImgTitle";
import MainMenuFilter from "../MainMenuFilter";
import QuestionBox from "../QuestionBox";

export default function Questions(){
    const [questions] = useState(
        [
            {title:'ترخینه چه امکانات متفاوتی داره؟',answer:'وبسایت سفارش غذای رستوران‌های زنجیره‌ای ترخینه با اتصال مستقیم به نرم افزار اتوماسیون شعبات رستوران، امکان اشتباهات هنگام ثبت سفارش آنلاین غذا و همچنین زمان مورد نیاز برای آماده سازی و تحویل آن را به حداقل ممکن می رسونه.'},
            {title:'چطور می تونم در ترخینه حساب کاربری ایجاد کنم؟',answer:'خیلی ساده، پس از انتخاب غذای مورد علاقه تان از منوی رستوران، هنگام ثبت سفارش با وارد کردن شماره تلفن همراه یک پیامک حاوی کد تایید برای شما ارسال و با وارد کردن کد تایید، ثبت نام شما تکمیل می شه. یا می تونید در صفحه اصلی سایت روی گزینه ورود کلیک کنید.'},
            {title:'سابقه و لیست خریدهای قبلی ام رو کجا ببینم؟',answer:'با ورود به حساب کاربری و کلیک روی گزینه سفارشات قبلی سابقه تمام خریدهای شما نمایش داده می شه.'},
            {title:'چه راه هایی برای پرداخت دارم؟',answer:'هنگام ثبت سفارش غذا می تونید روش پرداخت دلخواه خودتون رو انتخاب کنید. آنلاین و یا نقدی در هنگام تحویل سفارش بصورت حضوری.'},
            {title:'آیا قیمت در منوی وبسایت ترخینه با قیمت منوی شعبات رستوران یکسان است؟',answer:'بله. قیمت منوی وبسایت ترخینه دقیقا مطابق با قیمت منوی شعب رستوران  است و در صورت تغییر قیمت از طرف رستوران این تغییر در وبسایت ترخینه بلافاصله قابل مشاهده است.'},
            {title:'چطور می تونم از اعتبار هدیه و تخفیف استفاده کنم؟',answer:'برای استفاده از کد تخفیف میتونید به سادگی کد رو در سبد خرید، در قسمت مشخص شده وارد کنید. اعتبار هدیه هنگام انتخاب روش پرداخت برای شما نمایش داده میشه و در صورت تمایل میتونید ازش استفاده کنید.'},
        ]
    )
    return(
        <>
            <Header />
            <HeadBanner img='images/q-img.png' title='سوالات متداول از ترخینه'/>
            <MainMenuFilter/>
            <QuestionBox questions={questions}/>
            <Footer />
        </>
    )
}